# Задача: Функкция принимает имя и время суток ("утро", "день", "вечер").
#  Возвращает строку приветствия:
# утро -> "Доброе утро, {имя}!"
# день -> "Добрый день, {имя}!"
# вечер -> "Доброе вечер, {имя}!"
# другое -> "Привет, {имя}!"

def greet(name, time_of_day):
    if time_of_day == "утро":
        return f"Доброе утро, {name}!"
    elif time_of_day == "день":
        return f"Добрый день, {name}!"
    elif time_of_day == "вечер":
        return f"Добрый вечер, {name}!"
    else:
        return f"Привет, {name}!"


print(greet("Анна", "утро"))
print(greet("Виктор", "вечер"))